# # str1 = input("enter word: ")
# # print(str1)        #הדפסת המחרוזת
# # print(str1 + str1) #הדפסת המחרוזת פעמיים ברצף
# # print(str1*2)      #הכפלת המחרוזת ב2
# # print(str1[0])     #הדפסת המיקום ה[0] במחרוזת
# # print(len(str1))   #הדפסת אורך המחרוזת
# #
# # =================================================================
# # for i in str1:     #הדפסת כל ערכי המחרוזת אחד אחרי השני
# #     print(i)
# #
# # =================================================================
# # for i in range(len(str1)):   #הדפסת כל ערכי המחרוזת אחד אחרי השני על פי ערכי מיקום במחרוזת
# #     print(str1[i])
# #
# # =================================================================
# # print(str1[len(str1)-1])     #הדפסת התו האחרון במחרוזת
# #
# # ================================================================
# # ch = input("enter charcter") #ביחרת תו כלשהו
# # if ch in str1:               #בדיקה האם התו נמצא במחרוזת
# #     print("found")
# # else:
# #     print("not found")
# #
# # =================================================================
# # ch = input("enter charcter")  # ביחרת תו כלשהו
# # if not ch in str1:  # בדיקה האם התו לא נמצא במחרוזת
# #     print("not found")
# # else:
# #     print("found")
#
# a = 5                                                  #ביצוע פירמוט לערכים
# b = 6
# c = "abc"
# print("a={0} b={1} a+b={0}+{1} c={2}".format(a,b,c))   #
#
# print(f'a={a} b={b} a+b{a+b} c={c}')
#
# # =================================================================
#
# str1 = "abcde12345"
# print(str1[2:5])                                       #הדספסת ערכים מINDEX 2 עד 5(לא כולל)
# print(str1[:])                                         #הדפסת כל המחרוזת
# print(str1[:5])                                        #הדפסה מתחילת המחרוזת עד INDEX 5
# print(str1[5:])                                        #הדפסת המחרוזת מINDEX 5 עד הסוף
# print(str1[1:7:2])                                     #הדפסת המחרוזת מINDEX 1 ועד INDEX 7 בדילוגים של 2
# print(str1[7:1:-1])                                    #הדפסת המחרוזת מINDEX 7 ועד INDEX 1 בספירה לאחור
# print(str1[7::-1])                                     #הדפסת המחרוזת מINDEX 7 להתחלה
# print(str1[-2])                                        #הדפסת הערך האחרון לפני הסוף
# print(str1[-2:4:-1])                                   #INDEX 4 ההדפסה מהערך השני לפני הסוף ועד
#
# address = input("enter address: ")                       #החלפת תו מסויים בתו אחר
# len(address)
# address2 = address.replace('a','b')
# print(address2)
# print(address.replace(' ',"\n"))                         #פיצול המחרוזת לשורות נפרדות
# print(address.split(" "))                                #פירוק המחרוזת לגורמים והכנסה לרשימה (כאשר ישנו רווח, ניתן להחליף בתוים אחרים)
